---
title: VertexPositionNormalColored
classe: Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored
namespace: Autodesk.Revit.DB.DirectContext3D
eredita: Autodesk.Revit.DB.DirectContext3D.Vertex
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# VertexPositionNormalColored

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `XYZ Normal { get; set; }` | `vertexPositionNormalColored.Normal` | XYZ |
| `XYZ Position { get; set; }` | `vertexPositionNormalColored.Position` | XYZ |
| `ColorWithTransparency GetColor()` | `vertexPositionNormalColored.GetColor()` | ColorWithTransparency |
| `Int32 GetSizeInFloats()` | `VertexPositionNormalColored.GetSizeInFloats()` | Int32 |
| `Void SetColor(ColorWithTransparency)` | `vertexPositionNormalColored.SetColor(color)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```